###################################################################

# Created by write_sdc on Sat Dec 21 00:46:04 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ss0p72vm40c -max_library                         \
N16ADFP_StdCellss0p72vm40c_ccs\
                         -min ff0p88v125c -min_library                         \
N16ADFP_StdCellff0p88v125c_ccs
set_wire_load_mode top
set_wire_load_model -name ZeroWireload -library N16ADFP_StdCellss0p72vm40c_ccs
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 0.3  -waveform {0 0.15}
set_input_delay -clock clk  0  [get_ports rst]
set_input_delay -clock clk  0  [get_ports {x[8]}]
set_input_delay -clock clk  0  [get_ports {x[7]}]
set_input_delay -clock clk  0  [get_ports {x[6]}]
set_input_delay -clock clk  0  [get_ports {x[5]}]
set_input_delay -clock clk  0  [get_ports {x[4]}]
set_input_delay -clock clk  0  [get_ports {x[3]}]
set_input_delay -clock clk  0  [get_ports {x[2]}]
set_input_delay -clock clk  0  [get_ports {x[1]}]
set_input_delay -clock clk  0  [get_ports {x[0]}]
set_input_delay -clock clk  0  [get_ports {w0[15]}]
set_input_delay -clock clk  0  [get_ports {w0[14]}]
set_input_delay -clock clk  0  [get_ports {w0[13]}]
set_input_delay -clock clk  0  [get_ports {w0[12]}]
set_input_delay -clock clk  0  [get_ports {w0[11]}]
set_input_delay -clock clk  0  [get_ports {w0[10]}]
set_input_delay -clock clk  0  [get_ports {w0[9]}]
set_input_delay -clock clk  0  [get_ports {w0[8]}]
set_input_delay -clock clk  0  [get_ports {w0[7]}]
set_input_delay -clock clk  0  [get_ports {w0[6]}]
set_input_delay -clock clk  0  [get_ports {w0[5]}]
set_input_delay -clock clk  0  [get_ports {w0[4]}]
set_input_delay -clock clk  0  [get_ports {w0[3]}]
set_input_delay -clock clk  0  [get_ports {w0[2]}]
set_input_delay -clock clk  0  [get_ports {w0[1]}]
set_input_delay -clock clk  0  [get_ports {w0[0]}]
set_input_delay -clock clk  0  [get_ports {w1[15]}]
set_input_delay -clock clk  0  [get_ports {w1[14]}]
set_input_delay -clock clk  0  [get_ports {w1[13]}]
set_input_delay -clock clk  0  [get_ports {w1[12]}]
set_input_delay -clock clk  0  [get_ports {w1[11]}]
set_input_delay -clock clk  0  [get_ports {w1[10]}]
set_input_delay -clock clk  0  [get_ports {w1[9]}]
set_input_delay -clock clk  0  [get_ports {w1[8]}]
set_input_delay -clock clk  0  [get_ports {w1[7]}]
set_input_delay -clock clk  0  [get_ports {w1[6]}]
set_input_delay -clock clk  0  [get_ports {w1[5]}]
set_input_delay -clock clk  0  [get_ports {w1[4]}]
set_input_delay -clock clk  0  [get_ports {w1[3]}]
set_input_delay -clock clk  0  [get_ports {w1[2]}]
set_input_delay -clock clk  0  [get_ports {w1[1]}]
set_input_delay -clock clk  0  [get_ports {w1[0]}]
set_input_delay -clock clk  0  [get_ports {w2[15]}]
set_input_delay -clock clk  0  [get_ports {w2[14]}]
set_input_delay -clock clk  0  [get_ports {w2[13]}]
set_input_delay -clock clk  0  [get_ports {w2[12]}]
set_input_delay -clock clk  0  [get_ports {w2[11]}]
set_input_delay -clock clk  0  [get_ports {w2[10]}]
set_input_delay -clock clk  0  [get_ports {w2[9]}]
set_input_delay -clock clk  0  [get_ports {w2[8]}]
set_input_delay -clock clk  0  [get_ports {w2[7]}]
set_input_delay -clock clk  0  [get_ports {w2[6]}]
set_input_delay -clock clk  0  [get_ports {w2[5]}]
set_input_delay -clock clk  0  [get_ports {w2[4]}]
set_input_delay -clock clk  0  [get_ports {w2[3]}]
set_input_delay -clock clk  0  [get_ports {w2[2]}]
set_input_delay -clock clk  0  [get_ports {w2[1]}]
set_input_delay -clock clk  0  [get_ports {w2[0]}]
set_input_delay -clock clk  0  [get_ports {w3[15]}]
set_input_delay -clock clk  0  [get_ports {w3[14]}]
set_input_delay -clock clk  0  [get_ports {w3[13]}]
set_input_delay -clock clk  0  [get_ports {w3[12]}]
set_input_delay -clock clk  0  [get_ports {w3[11]}]
set_input_delay -clock clk  0  [get_ports {w3[10]}]
set_input_delay -clock clk  0  [get_ports {w3[9]}]
set_input_delay -clock clk  0  [get_ports {w3[8]}]
set_input_delay -clock clk  0  [get_ports {w3[7]}]
set_input_delay -clock clk  0  [get_ports {w3[6]}]
set_input_delay -clock clk  0  [get_ports {w3[5]}]
set_input_delay -clock clk  0  [get_ports {w3[4]}]
set_input_delay -clock clk  0  [get_ports {w3[3]}]
set_input_delay -clock clk  0  [get_ports {w3[2]}]
set_input_delay -clock clk  0  [get_ports {w3[1]}]
set_input_delay -clock clk  0  [get_ports {w3[0]}]
set_input_delay -clock clk  0  [get_ports {w4[15]}]
set_input_delay -clock clk  0  [get_ports {w4[14]}]
set_input_delay -clock clk  0  [get_ports {w4[13]}]
set_input_delay -clock clk  0  [get_ports {w4[12]}]
set_input_delay -clock clk  0  [get_ports {w4[11]}]
set_input_delay -clock clk  0  [get_ports {w4[10]}]
set_input_delay -clock clk  0  [get_ports {w4[9]}]
set_input_delay -clock clk  0  [get_ports {w4[8]}]
set_input_delay -clock clk  0  [get_ports {w4[7]}]
set_input_delay -clock clk  0  [get_ports {w4[6]}]
set_input_delay -clock clk  0  [get_ports {w4[5]}]
set_input_delay -clock clk  0  [get_ports {w4[4]}]
set_input_delay -clock clk  0  [get_ports {w4[3]}]
set_input_delay -clock clk  0  [get_ports {w4[2]}]
set_input_delay -clock clk  0  [get_ports {w4[1]}]
set_input_delay -clock clk  0  [get_ports {w4[0]}]
set_input_delay -clock clk  0  [get_ports {w5[15]}]
set_input_delay -clock clk  0  [get_ports {w5[14]}]
set_input_delay -clock clk  0  [get_ports {w5[13]}]
set_input_delay -clock clk  0  [get_ports {w5[12]}]
set_input_delay -clock clk  0  [get_ports {w5[11]}]
set_input_delay -clock clk  0  [get_ports {w5[10]}]
set_input_delay -clock clk  0  [get_ports {w5[9]}]
set_input_delay -clock clk  0  [get_ports {w5[8]}]
set_input_delay -clock clk  0  [get_ports {w5[7]}]
set_input_delay -clock clk  0  [get_ports {w5[6]}]
set_input_delay -clock clk  0  [get_ports {w5[5]}]
set_input_delay -clock clk  0  [get_ports {w5[4]}]
set_input_delay -clock clk  0  [get_ports {w5[3]}]
set_input_delay -clock clk  0  [get_ports {w5[2]}]
set_input_delay -clock clk  0  [get_ports {w5[1]}]
set_input_delay -clock clk  0  [get_ports {w5[0]}]
set_input_delay -clock clk  0  [get_ports {w6[15]}]
set_input_delay -clock clk  0  [get_ports {w6[14]}]
set_input_delay -clock clk  0  [get_ports {w6[13]}]
set_input_delay -clock clk  0  [get_ports {w6[12]}]
set_input_delay -clock clk  0  [get_ports {w6[11]}]
set_input_delay -clock clk  0  [get_ports {w6[10]}]
set_input_delay -clock clk  0  [get_ports {w6[9]}]
set_input_delay -clock clk  0  [get_ports {w6[8]}]
set_input_delay -clock clk  0  [get_ports {w6[7]}]
set_input_delay -clock clk  0  [get_ports {w6[6]}]
set_input_delay -clock clk  0  [get_ports {w6[5]}]
set_input_delay -clock clk  0  [get_ports {w6[4]}]
set_input_delay -clock clk  0  [get_ports {w6[3]}]
set_input_delay -clock clk  0  [get_ports {w6[2]}]
set_input_delay -clock clk  0  [get_ports {w6[1]}]
set_input_delay -clock clk  0  [get_ports {w6[0]}]
set_input_delay -clock clk  0  [get_ports {w7[15]}]
set_input_delay -clock clk  0  [get_ports {w7[14]}]
set_input_delay -clock clk  0  [get_ports {w7[13]}]
set_input_delay -clock clk  0  [get_ports {w7[12]}]
set_input_delay -clock clk  0  [get_ports {w7[11]}]
set_input_delay -clock clk  0  [get_ports {w7[10]}]
set_input_delay -clock clk  0  [get_ports {w7[9]}]
set_input_delay -clock clk  0  [get_ports {w7[8]}]
set_input_delay -clock clk  0  [get_ports {w7[7]}]
set_input_delay -clock clk  0  [get_ports {w7[6]}]
set_input_delay -clock clk  0  [get_ports {w7[5]}]
set_input_delay -clock clk  0  [get_ports {w7[4]}]
set_input_delay -clock clk  0  [get_ports {w7[3]}]
set_input_delay -clock clk  0  [get_ports {w7[2]}]
set_input_delay -clock clk  0  [get_ports {w7[1]}]
set_input_delay -clock clk  0  [get_ports {w7[0]}]
set_input_delay -clock clk  0  [get_ports {w8[15]}]
set_input_delay -clock clk  0  [get_ports {w8[14]}]
set_input_delay -clock clk  0  [get_ports {w8[13]}]
set_input_delay -clock clk  0  [get_ports {w8[12]}]
set_input_delay -clock clk  0  [get_ports {w8[11]}]
set_input_delay -clock clk  0  [get_ports {w8[10]}]
set_input_delay -clock clk  0  [get_ports {w8[9]}]
set_input_delay -clock clk  0  [get_ports {w8[8]}]
set_input_delay -clock clk  0  [get_ports {w8[7]}]
set_input_delay -clock clk  0  [get_ports {w8[6]}]
set_input_delay -clock clk  0  [get_ports {w8[5]}]
set_input_delay -clock clk  0  [get_ports {w8[4]}]
set_input_delay -clock clk  0  [get_ports {w8[3]}]
set_input_delay -clock clk  0  [get_ports {w8[2]}]
set_input_delay -clock clk  0  [get_ports {w8[1]}]
set_input_delay -clock clk  0  [get_ports {w8[0]}]
set_input_delay -clock clk  0  [get_ports {b[15]}]
set_input_delay -clock clk  0  [get_ports {b[14]}]
set_input_delay -clock clk  0  [get_ports {b[13]}]
set_input_delay -clock clk  0  [get_ports {b[12]}]
set_input_delay -clock clk  0  [get_ports {b[11]}]
set_input_delay -clock clk  0  [get_ports {b[10]}]
set_input_delay -clock clk  0  [get_ports {b[9]}]
set_input_delay -clock clk  0  [get_ports {b[8]}]
set_input_delay -clock clk  0  [get_ports {b[7]}]
set_input_delay -clock clk  0  [get_ports {b[6]}]
set_input_delay -clock clk  0  [get_ports {b[5]}]
set_input_delay -clock clk  0  [get_ports {b[4]}]
set_input_delay -clock clk  0  [get_ports {b[3]}]
set_input_delay -clock clk  0  [get_ports {b[2]}]
set_input_delay -clock clk  0  [get_ports {b[1]}]
set_input_delay -clock clk  0  [get_ports {b[0]}]
set_output_delay -clock clk  0  [get_ports {out[35]}]
set_output_delay -clock clk  0  [get_ports {out[34]}]
set_output_delay -clock clk  0  [get_ports {out[33]}]
set_output_delay -clock clk  0  [get_ports {out[32]}]
set_output_delay -clock clk  0  [get_ports {out[31]}]
set_output_delay -clock clk  0  [get_ports {out[30]}]
set_output_delay -clock clk  0  [get_ports {out[29]}]
set_output_delay -clock clk  0  [get_ports {out[28]}]
set_output_delay -clock clk  0  [get_ports {out[27]}]
set_output_delay -clock clk  0  [get_ports {out[26]}]
set_output_delay -clock clk  0  [get_ports {out[25]}]
set_output_delay -clock clk  0  [get_ports {out[24]}]
set_output_delay -clock clk  0  [get_ports {out[23]}]
set_output_delay -clock clk  0  [get_ports {out[22]}]
set_output_delay -clock clk  0  [get_ports {out[21]}]
set_output_delay -clock clk  0  [get_ports {out[20]}]
set_output_delay -clock clk  0  [get_ports {out[19]}]
set_output_delay -clock clk  0  [get_ports {out[18]}]
set_output_delay -clock clk  0  [get_ports {out[17]}]
set_output_delay -clock clk  0  [get_ports {out[16]}]
set_output_delay -clock clk  0  [get_ports {out[15]}]
set_output_delay -clock clk  0  [get_ports {out[14]}]
set_output_delay -clock clk  0  [get_ports {out[13]}]
set_output_delay -clock clk  0  [get_ports {out[12]}]
set_output_delay -clock clk  0  [get_ports {out[11]}]
set_output_delay -clock clk  0  [get_ports {out[10]}]
set_output_delay -clock clk  0  [get_ports {out[9]}]
set_output_delay -clock clk  0  [get_ports {out[8]}]
set_output_delay -clock clk  0  [get_ports {out[7]}]
set_output_delay -clock clk  0  [get_ports {out[6]}]
set_output_delay -clock clk  0  [get_ports {out[5]}]
set_output_delay -clock clk  0  [get_ports {out[4]}]
set_output_delay -clock clk  0  [get_ports {out[3]}]
set_output_delay -clock clk  0  [get_ports {out[2]}]
set_output_delay -clock clk  0  [get_ports {out[1]}]
set_output_delay -clock clk  0  [get_ports {out[0]}]
set_output_delay -clock clk  0  [get_ports en]
